Davidap041/Arm_Code_KL43z/Robot_ARM_MCU_KL43z_Controladores/Robot_Arm_Control_Law_Ref/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '20', peripheral: I2C0, signal: SCL, pin_signal: PTE24/TPM0_CH0/I2C0_SCL, identifier: Sensor_1_e_2_SCL}
  - {pin_num: '21', peripheral: I2C0, signal: SDA, pin_signal: PTE25/TPM0_CH1/I2C0_SDA, identifier: Sensor_1_e_2_SDA}
  - {pin_num: '2', peripheral: I2C1, signal: SCL, pin_signal: LCD_P49/PTE1/SPI1_MOSI/LPUART1_RX/SPI1_MISO/I2C1_SCL, identifier: Sensor_3_e_4_SCL}
  - {pin_num: '1', peripheral: I2C1, signal: SDA, pin_signal: LCD_P48/PTE0/CLKOUT32K/SPI1_MISO/LPUART1_TX/RTC_CLKOUT/CMP0_OUT/I2C1_SDA, identifier: Sensor_3_e_4_SDA}
  - {pin_num: '25', peripheral: TPM0, signal: 'CH, 0', pin_signal: PTA3/I2C1_SCL/TPM0_CH0/SWD_DIO, direction: OUTPUT}
  - {pin_num: '26', peripheral: TPM0, signal: 'CH, 1', pin_signal: PTA4/I2C1_SDA/TPM0_CH1/NMI_b, identifier: PWM2, direction: OUTPUT}
  - {pin_num: '27', peripheral: TPM0, signal: 'CH, 2', pin_signal: PTA5/USB_CLKIN/TPM0_CH2/I2S0_TX_BCLK, identifier: PWM3, direction: OUTPUT}
  - {pin_num: '60', peripheral: TPM0, signal: 'CH, 3', pin_signal: LCD_P43/PTD3/SPI0_MISO/UART2_TX/TPM0_CH3/SPI0_MOSI/FXIO0_D3, identifier: PWM4, direction: OUTPUT}
  - {pin_num: '61', peripheral: TPM0, signal: 'CH, 4', pin_signal: LCD_P44/PTD4/LLWU_P14/SPI1_SS/UART2_RX/TPM0_CH4/FXIO0_D4, identifier: PWM5, direction: OUTPUT}
  - {pin_num: '62', peripheral: TPM0, signal: 'CH, 5', pin_signal: LCD_P45/ADC0_SE6b/PTD5/SPI1_SCK/UART2_TX/TPM0_CH5/FXIO0_D5, identifier: PWM6, direction: OUTPUT}
  - {pin_num: '18', peripheral: DAC0, signal: OUT, pin_signal: DAC0_OUT/ADC0_SE23/CMP0_IN4/PTE30/TPM0_CH3/TPM_CLKIN1/LPUART1_TX/LPTMR0_ALT1}
  - {pin_num: '35', peripheral: GPIOB, signal: 'GPIO, 0', pin_signal: LCD_P0/ADC0_SE8/PTB0/LLWU_P5/I2C0_SCL/TPM1_CH0, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '36', peripheral: GPIOB, signal: 'GPIO, 1', pin_signal: LCD_P1/ADC0_SE9/PTB1/I2C0_SDA/TPM1_CH1, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '37', peripheral: GPIOB, signal: 'GPIO, 2', pin_signal: LCD_P2/ADC0_SE12/PTB2/I2C0_SCL/TPM2_CH0, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '38', peripheral: GPIOB, signal: 'GPIO, 3', pin_signal: LCD_P3/ADC0_SE13/PTB3/I2C0_SDA/TPM2_CH1, direction: OUTPUT, gpio_init_state: 'true'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t Sensor_1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin 35)  */
    GPIO_PinInit(BOARD_Sensor_1_GPIO, BOARD_Sensor_1_PIN, &Sensor_1_config);

    gpio_pin_config_t Sensor_2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB1 (pin 36)  */
    GPIO_PinInit(BOARD_Sensor_2_GPIO, BOARD_Sensor_2_PIN, &Sensor_2_config);

    gpio_pin_config_t Sensor_3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB2 (pin 37)  */
    GPIO_PinInit(BOARD_Sensor_3_GPIO, BOARD_Sensor_3_PIN, &Sensor_3_config);

    gpio_pin_config_t Sensor_4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB3 (pin 38)  */
    GPIO_PinInit(BOARD_Sensor_4_GPIO, BOARD_Sensor_4_PIN, &Sensor_4_config);

    /* PORTA3 (pin 25) is configured as TPM0_CH0 */
    PORT_SetPinMux(BOARD_PWM1_PORT, BOARD_PWM1_PIN, kPORT_MuxAlt3);

    /* PORTA4 (pin 26) is configured as TPM0_CH1 */
    PORT_SetPinMux(BOARD_PWM2_PORT, BOARD_PWM2_PIN, kPORT_MuxAlt3);

    /* PORTA5 (pin 27) is configured as TPM0_CH2 */
    PORT_SetPinMux(BOARD_PWM3_PORT, BOARD_PWM3_PIN, kPORT_MuxAlt3);

    /* PORTB0 (pin 35) is configured as PTB0 */
    PORT_SetPinMux(BOARD_Sensor_1_PORT, BOARD_Sensor_1_PIN, kPORT_MuxAsGpio);

    /* PORTB1 (pin 36) is configured as PTB1 */
    PORT_SetPinMux(BOARD_Sensor_2_PORT, BOARD_Sensor_2_PIN, kPORT_MuxAsGpio);

    /* PORTB2 (pin 37) is configured as PTB2 */
    PORT_SetPinMux(BOARD_Sensor_3_PORT, BOARD_Sensor_3_PIN, kPORT_MuxAsGpio);

    /* PORTB3 (pin 38) is configured as PTB3 */
    PORT_SetPinMux(BOARD_Sensor_4_PORT, BOARD_Sensor_4_PIN, kPORT_MuxAsGpio);

    /* PORTD3 (pin 60) is configured as TPM0_CH3 */
    PORT_SetPinMux(BOARD_PWM4_PORT, BOARD_PWM4_PIN, kPORT_MuxAlt4);

    /* PORTD4 (pin 61) is configured as TPM0_CH4 */
    PORT_SetPinMux(BOARD_PWM5_PORT, BOARD_PWM5_PIN, kPORT_MuxAlt4);

    /* PORTD5 (pin 62) is configured as TPM0_CH5 */
    PORT_SetPinMux(BOARD_PWM6_PORT, BOARD_PWM6_PIN, kPORT_MuxAlt4);

    /* PORTE0 (pin 1) is configured as I2C1_SDA */
    PORT_SetPinMux(BOARD_Sensor_3_e_4_SDA_PORT, BOARD_Sensor_3_e_4_SDA_PIN, kPORT_MuxAlt6);

    /* PORTE1 (pin 2) is configured as I2C1_SCL */
    PORT_SetPinMux(BOARD_Sensor_3_e_4_SCL_PORT, BOARD_Sensor_3_e_4_SCL_PIN, kPORT_MuxAlt6);

